app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("companyName", "created_at", "deliveryAddress", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)