app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 28 Nov 2015 00:27:06 UTC +00:00], ["updated_at", Sat, 28 Nov 2015 00:27:06 UTC +00:00]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "stock" = ?, "updated_at" = ? WHERE "products"."id" = 9  [["stock", 101], ["updated_at", Sun, 29 Nov 2015 04:21:28 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)