app/controllers/sessions_controller.rb

  def create
    customer = Customer.find_by(email: params[:session][:email].downcase)
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`email` = 'derekf@uga.edu' LIMIT 1